In [2]:
import numpy as np
import pandas as pd

In [2]:
data = pd.read_excel(r"C:\Users\HP\Desktop\Bajaj_Assignment1\Assignment1.xlsx", sheet_name= None)

In [3]:
data['Accounts'].isna().sum()

AccountId    0
Name         0
Age          0
City         4
State        4
Pincode      4
dtype: int64

In [4]:
data['Accounts'].City = data['Accounts'].City.fillna('Unknown')
data['Accounts'].State = data['Accounts'].State.fillna('Unknown')
data['Accounts'].Pincode = data['Accounts'].Pincode.fillna('0')

In [5]:

data['Accounts'].isna().sum()

AccountId    0
Name         0
Age          0
City         0
State        0
Pincode      0
dtype: int64

In [6]:
data['Claims'].isna().sum()

Id              0
CreatedDate     0
CaseNumber      0
HAN            43
BillAmount      1
Status          0
AccountId       0
dtype: int64

In [34]:
data['Claims'].HAN = data['Claims'].HAN.fillna('Unknown')
data['Claims'].BillAmount = data['Claims'].HAN.fillna(0)

In [35]:
data['Claims'].isna().sum()

Id             0
CreatedDate    0
CaseNumber     0
HAN            0
BillAmount     0
Status         0
AccountId      0
dtype: int64

In [36]:
data['Policies'].isna().sum()

HAN            0
Policy Name    0
dtype: int64

In [37]:
with pd.ExcelWriter('Data.xlsx') as writer:  
    data['Accounts'].to_excel(writer, sheet_name='Accounts')
    data['Claims'].to_excel(writer, sheet_name='Claims')
    data['Policies'].to_excel(writer, sheet_name='Policies')

In [7]:
data = pd.read_excel(r"C:\Users\HP\Desktop\Bajaj_Assignment1\Data.xlsx", sheet_name= None)
accounts = data['Accounts']
claims = data['Claims']
policies = data['Policies']

In [8]:
accounts.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  60 non-null     int64
 1   AccountId   60 non-null     object
 2   Name        60 non-null     object
 3   Age         60 non-null     int64
 4   City        60 non-null     object
 5   State       60 non-null     object
 6   Pincode     60 non-null     int64
dtypes: int64(3), object(4)
memory usage: 3.4+ KB

In [62]:

claim = claims[claims['Id'] == '5008p000001I11XAAS']
claim

,Unnamed: 0,Id,CreatedDate,CaseNumber,HAN,BillAmount,Status,AccountId
0,0,5008p000001I11XAAS,2021-10-20T03:03:45.000+0000,SR00754586,01CHSP0000002222,01CHSP0000002222,Paid,0012j00000GjoGnAAJ

In [64]:
account_id = claim['AccountId']
account_id[0]

'0012j00000GjoGnAAJ'

In [65]:
details = accounts[accounts['AccountId'] == account_id[0]]

In [66]:
details

,Unnamed: 0,AccountId,Name,Age,City,State,Pincode
0,0,0012j00000GjoGnAAJ,Testt test Kumarr,29,Pune,Maharashtra,411040

In [10]:
data = pd.read_excel(r"C:\Users\HP\Desktop\Bajaj_Assignment1\Data.xlsx", sheet_name=None)
accounts = data['Accounts'].iloc[:, 0:]

In [11]:
accounts

,AccountId,Name,Age,City,State,Pincode
0,0012j00000GjoGnAAJ,Testt test Kumarr,29,Pune,Maharashtra,411040
1,0012j00000GmxLdAAJ,Testeshaan Testaggarwal,33,Pune,Maharashtra,411004
2,0018p0000054vjzAAA,Divyatest Test Test,33,Pune,Maharashtra,411004
3,0018p000004rhlqAAA,Test1 Test Test2,33,Pune,Maharashtra,411004
4,0018p00000552gZAAQ,Test Test Test,33,Pune,Maharashtra,411004
...,...,...,...,...,...,...
56,001OA00000BpXNCYA3,Shweta Test,31,Pune,MH,411004
57,0018p000003rjI5AAI,Mayur Test,39,Buldhana,Maharashtra,443104
58,001OA00000Dat51YAB,Ameya Kumar Test,39,Palghar,Maharashtra,401305
59,001OA0000032e6lYAA,Test Nandnihexa,25,Unknown,Unknown,0
60,001A,Aarin,20,string,string,0

In [12]:
cus_data = accounts[accounts['AccountId'] == '001A']

In [7]:
accounts

                       Name  Age      City        State  Pincode
0         Testt test Kumarr   29      Pune  Maharashtra   411040
1   Testeshaan Testaggarwal   33      Pune  Maharashtra   411004
2       Divyatest Test Test   33      Pune  Maharashtra   411004
3          Test1 Test Test2   33      Pune  Maharashtra   411004
4            Test Test Test   33      Pune  Maharashtra   411004
..                      ...  ...       ...          ...      ...
56              Shweta Test   31      Pune           MH   411004
57               Mayur Test   39  Buldhana  Maharashtra   443104
58         Ameya Kumar Test   39   Palghar  Maharashtra   401305
59          Test Nandnihexa   25   Unknown      Unknown        0
60                    Aarin   20    string       string        0

[61 rows x 5 columns]